## Plan Result (stg_backend_database)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.postgresql_password
  * azurerm_key_vault_secret.postgresql_username




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.postgresql_password will be created
  + resource "azurerm_key_vault_secret" "postgresql_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.KeyVault/vaults/crime-portal-kv-stg"
      + name                    = "crime-portal-postgresql-stg-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.postgresql_username will be created
  + resource "azurerm_key_vault_secret" "postgresql_username" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ae75b9fb-7d34-4112-82ff-64bd3855ce27/resourceGroups/crime-portal-rg-stg/providers/Microsoft.KeyVault/vaults/crime-portal-kv-stg"
      + name                    = "crime-portal-postgresql-stg-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"","Target":"stg_backend_database","Vars":{}} -->